{
  "nav": {
    "about": "About",
    "projects": "Projects",
    "contact": "Contact"
  },
  "introduce": {
    "hi": "Hi there!",
    "im": "I'm",
    "firstname": "Valentin",
    "lastname": "HIPPOLYTE",
    "job": "Full Stack Developer",
    "cv": "my cv"
  },
  "aboutMe": {
    "title1": "ABOUT",
    "title2": "ME",
    "who": "WHO AM I?",
    "skills": "SKILLS",
    "presentation1": "Hello, my name is Valentin HIPPOLYTE, a motivated and dynamic developer with a Master’s degree in <span class='font-[800]'>Computer Engineering</span>.",
    "presentation2": "After <span class='font-[800]'>three years</span> of apprenticeship at <span class='font-[800]'>Worldline</span>, where I developed features for international banking clients, I am now looking for a <span class='font-[800]'>new professional challenge</span>.",
    "languages": "Languages & Frameworks:",
    "tools": "Tools & Workflow:"
  },
  "projects": {
    "title1": "SOME",
    "title2": "PROJECTS",
    "description": {
      "casa-cal-y-sol": "A showcase website for a family vacation home in Andalusia with an integrated booking system.",
      "ghiblix": "An app to discover and manage Ghibli films: add to favorites, track views, and explore films.",
      "full-stack-boilerplate": "A minimal full-stack application template designed to serve as a starting point, containerized with Docker."
    },
    "project-info": {
      "casa-cal-y-sol": {
        "description": "A showcase website developed for a family vacation home in Andalusia. Presentation, availability, and a reservation form are all designed to create a simple and welcoming experience.",
        "features": {
          "1": "Development of the site based on a personalized graphic charter",
          "2": "Availability calendar synchronized with Smoobu",
          "3": "Contact and booking form",
          "4": "Multilingual version with translation management (Vue I18n)"
        },
        "challenge": "Integration of the Smoobu API by bypassing their widget for a 100% personalized calendar display, in accordance with the graphic charter and user experience."
      },
      "ghiblix": {
        "description": "Ghiblix is ​​a full-stack application I developed to combine personal enjoyment with skill development. It allows you to discover Studio Ghibli films, view their profiles, and track those you've already seen, all in a simple, responsive interface.",
        "features": {
          "1": "Complete list of Studio Ghibli movies, with posters, titles, and summaries",
          "2": "Ability to mark movies as 'watched' to track your progress",
          "3": "Detailed movie pages with description, release date, director, etc.",
          "4": "Sign up / login with JWT to manage a personal profile and save your data"
        },
        "challenge": "Managing user state (movies watched) securely and persistently. Implementing a REST API with JWT authentication for personal tracking. This project allowed me to structure a complete Full Stack architecture and adopt a clean Git workflow, even solo."
      },
      "full-stack-boilerplate": {
        "description": "Minimal full-stack application template designed as a flexible foundation for web projects. Clear front-end/back-end architecture, containerized with Docker for simplified and consistent deployment.",
        "features": {
          "1": "Scalable, customizable full-stack app structure",
          "2": "JWT-based user authentication for secure access",
          "3": "Development environment with Docker containers for front-end, back-end, and database",
          "4": "Configuration of services (front-end, back-end, and MongoDB) in a single docker-compose.yml file"
        },
        "challenge": "Understanding Docker and multi-container environments through a minimal Full Stack model, with clear integration of front, back, and database."
      },
      "main_features": "Main Features",
      "challenges": "Challenges",
      "previous": "previous",
      "next": "next",
      "profile": "profile"
    }
  },
  "contactMe": {
    "title1": "CONTACT",
    "title2": "ME",
    "phone": {
      "title": "Phone",
      "value": "+33 6 61 08 62 20"
    },
    "mail": {
      "title": "Email"
    },
    "address": {
      "title": "Address",
      "value": "Montpellier and around"
    },
    "follow": "Follow",
    "me": "me"
  },
  "rights": "All rights reserved"
}
