{
  "nav": {
    "about": "À propos",
    "projects": "Projets",
    "contact": "Contact"
  },
  "introduce": {
    "hi": "Bonjour !",
    "im": "C'est",
    "firstname": "Valentin",
    "lastname": "HIPPOLYTE",
    "job": "Développeur Full Stack",
    "cv": "mon cv"
  },
  "aboutMe": {
    "title1": "À PROPOS",
    "title2": "DE MOI",
    "who": "QUI SUIS-JE ?",
    "skills": "Compétences",
    "presentation1": "Bonjour, je m'appelle Valentin HIPPOLYTE, un développeur motivé et dynamique, diplômé d'un Master <span class='font-[800]'>Expert en ingénierie informatique</span>.",
    "presentation2": "Après <span class='font-[800]'>trois ans</span> d’alternance chez <span class='font-[800]'>Worldline</span>, où j’ai contribué au développement de fonctionnalités pour des <span class='font-[800]'>clients bancaires internationaux</span>, je suis aujourd’hui à la recherche d’un <span class='font-[800]'>nouveau défi professionnel</span>.",
    "languages": "Langages et Frameworks:",
    "tools": "Outils et Workflow:"
  },
  "projects": {
    "title1": "QUELQUES",
    "title2": "PROJETS",
    "description": {
      "casa-cal-y-sol": "Un site vitrine pour une maison de vacances en Andalousie avec un système de réservation intégré.",
      "ghiblix": "Une application pour découvrir et gérer les films des studios Ghibli : ajout aux favoris, suivi de vue et exploration des films.",
      "full-stack-boilerplate": "Un modèle d'application full-stack minimal conçu pour servir de point de départ, conteneurisé avec Docker."
    },
    "project-info": {
      "casa-cal-y-sol": {
        "description": "Site vitrine développé pour une maison de vacances familiale en Andalousie. Présentation, disponibilités, formulaire de réservation, tout est pensé pour une expérience simple et chaleureuse.",
        "features": {
          "1": "Développement du site à partir d’une charte graphique personnalisée",
          "2": "Calendrier de disponibilités synchronisé avec Smoobu",
          "3": "Formulaire de contact et de réservation",
          "4": "Version multilingue avec gestion des traductions (Vue I18n)"
        },
        "challenge": "Intégration de l’API Smoobu en contournant leur widget pour un affichage du calendrier 100 % personnalisé, en accord avec la charte graphique et l’expérience utilisateur."
      },
      "ghiblix": {
        "description": "Ghiblix est une application Full Stack que j’ai développée pour allier plaisir personnel et montée en compétences. Elle permet de découvrir les films du studio Ghibli, consulter leurs fiches et suivre ceux déjà vus, dans une interface sobre et responsive.",
        "features": {
          "1": "Liste complète des films du studio, avec affiches, titres et résumés",
          "2": "Possibilité de marquer les films comme “vus” pour suivre sa progression",
          "3": "Accès aux informations complètes d’un film : description, date de sortie, réalisateur, etc.",
          "4": "Connexion / inscription avec JWT pour gérer un profil et sauvegarder ses données"
        },
        "challenge": "Gérer l’état utilisateur (films vus) de façon sécurisée et persistante. Mise en place d’une API REST avec authentification JWT pour un suivi personnel. Ce projet m’a permis de structurer une architecture Full Stack complète et d’adopter un workflow Git propre, même en solo."
      },
      "full-stack-boilerplate": {
        "description": "Modèle d’application Full Stack minimal, conçu comme base flexible pour des projets web. Architecture claire front/back, conteneurisée avec Docker pour un déploiement simplifié et cohérent.",
        "features": {
          "1": "Structure d'application full-stack évolutive et personnalisable",
          "2": "Authentification utilisateur basée sur JWT pour un accès sécurisé",
          "3": "Environnement avec conteneurs Docker pour le front-end, le back-end et la base de données",
          "4": "Configuration des services (front-end, back-end et MongoDB) dans un seul fichier docker-compose.yml"
        },
        "challenge": "Comprendre Docker et les environnements multi-conteneurs à travers un modèle Full Stack minimal, avec intégration claire du front, du back et de la BDD."
      },
      "main_features": "Fonctionnalités principales",
      "challenges": "Défis",
      "previous": "précédent",
      "next": "suivant",
      "profile": "profil"
    }
  },
  "contactMe": {
    "title1": "CONTACTE",
    "title2": "MOI",
    "phone": {
      "title": "Téléphone",
      "value": "06 61 08 62 20"
    },
    "mail": {
      "title": "Mail"
    },
    "address": {
      "title": "Adresse",
      "value": "Montpellier et alentours"
    },
    "follow": "Suis",
    "me": "moi"
  },
  "rights": "Tous droits réservés"
}
